test/pipe/constant/transportProperties
/*-----------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*-----------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          transportProperties;
}

//------------------------------------------------------------------------------

transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 0.01;
