test/pipe/system/refineMeshDict
/*---------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set baffleCells;

useHexTopology true;

writeMesh false;

coordinateSystem global;

globalCoeffs
{
    tan1 (1 0 0);
    tan2 (0 1 0);
}

directions
(
    tan1
    tan2
    normal
);
