test/pipe/system/topoSetDict
/*---------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    baffleCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (4.8 0 0) (5.2 1 1);
        }
    }
    {
        name    baffleCells;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set baffleCells;
        }
    }
);

// ************************************************************************* //
